<?php


// С помощью оператора echo выведите на страницу целочисленную переменную
$varInt = 3;
echo $varInt;

echo '<br>';
// С помощью оператора echo выведите на страницу переменную дробного типа
$varFloat = 3.34;
echo $varFloat;

echo '<br>';
// С помощью оператора echo выведите на страницу переменную булевского типа
// Вопрос: почему у меня при значении false ничего не выводит, а при true выводит единицу? Это версия php? 
$varBool = true;
echo $varBool;

echo '<br>';
// С помощью оператора echo выведите на страницу строковую переменную
$varStr = 'Строка';
echo $varStr;